{
    "employment": [
        {
            "name": "OptimoRoute",
            "position": "Lead UX Designer",
            "period": "August 2017 - present",
            "url": "https://optimoroute.com/",
            "id": "optimoroute",
            "introduction": "I have started underlayer studio with hopes I will be able to run a business all by myself. I worked on a few nice projects. But, it was a tough year. I learned a lot. I saw how business requires a lot of effort so now I can appreciate business people much more.",
            "learned": [
                "How starting my own company looks like.",
                "How to run my own company looks like, and how that can be hard.",
                "How to better organise myself."
            ]
        },
        {
            "name": "Underlayer",
            "position": "Founder, designer and developer",
            "period": "January 2016 - present",
            "url": "https://underlayer.netlify.com/",
            "id": "underlayer",
            "introduction": "I have started underlayer studio with hopes I will be able to run a business all by myself. I worked on a few nice projects. But, it was a tough year. I learned a lot. I saw how business requires a lot of effort so now I can appreciate business people much more.",
            "learned": [
                "How starting my own company looks like.",
                "How to run my own company looks like, and how that can be hard.",
                "How to better organise myself."
            ],
            "projects": [
                {
                    "name": "Memgraph",
                    "url": "http://bit.ly/2jqAJjz",
                    "id": "memgraph",
                    "description": "MemGraph is a young startup that is building next generation graph database system. I designed their logo and overall design language fo app. Also, I was working on designing and coding a web interface that will be used for querying the database, monitoring machines, and monitoring performances."
                },
                {
                    "name": "Agrivi",
                    "url": "http://bit.ly/2jqswvS",
                    "id": "agrivi",
                    "description": "Agrivi is agri-tech startup from Croatia. I worked on redesigning their brand identity:  a new logo, font, color palette, visual language, and imagery. My primary job was to redesign the web application interface, so I worked with product guys to deliver the best experience for their users. Lastly, I worked on the landing page redesign as well."
                }
            ]
        },
        {
            "name": "Vibby",
            "position": "Designer and developer",
            "period": "March 2015 - January 2016",
            "url": "http://bit.ly/2jqr9NC",
            "id": "vibby",
            "introduction": "Vibby is US based startup, I had a chance to work as lead product designer. I was involved in branding, introducing new product concepts, designing experience and interface, as well as coding HTML and CSS architecture of this large scale web application. Year almost passed, and I saw I gave all that I could to the idea, so I decided I should try to go on my own.",
            "learned": [
                "How working in a startup looks like.",
                "How to design a product from the ground.",
                "How to be a design lead.",
                "How to code large scale front-end architecture.",
                "How to work with the team of people who are as old as I."
            ],
            "projects": [
                {
                    "name": "Vibby player",
                    "url": "http://bit.ly/2k4EpIR",
                    "id": "vibby-player",
                    "description": "Video player that introduced “partial” video bits. It allowed users to watch and comment only on important/highlighted parts of the video."
                },
                {
                    "name": "Vib creation proces",
                    "url": "http://bit.ly/2ktXEw1",
                    "id": "vib-creation",
                    "description": "A simple three step process user had to go through in order to create a “vib” - a shorter form of a video created from its parts."
                }
            ]
        },
        {
            "name": "Grey Entourage",
            "position": "Screen Designer",
            "period": "July 2014 - March 2015",
            "url": "http://bit.ly/2jy4n3N",
            "id": "grey-entourage",
            "introduction": "In joint venture Gray Entourage, I was involved in advertising projects ranging from designing online advertising materials for clients like Microsoft, Erste Bank, Vipnet and Tomato, to designing urls for TZ Istra and Allianz. After almost a year, and beautiful time I have spent with the team, I got a chance to work fro startup that I couldn't reject.",
            "learned": [
                "How working in a big advertising agency looks like.",
                "How to work simultaneously on 100 things.",
                "I became Adobe Illustrator ninja.",
                "How big clients' campaigns are made. Including everything from filming TV commercials to designing web banners.",
                "Some “old” people are way cooler than “young” people."
            ],
            "projects": [
                {
                    "name": "Vip Xmas Card",
                    "url": "http://on.be.net/1X0ZZM4",
                    "id": "vip-xmas-card",
                    "description": "I was involved in the whole process: from the beginning of ideation and character development to UI design and character illustration."
                },
                {
                    "name": "Share Istria",
                    "url": "http://bit.ly/2jfOgaf",
                    "id": "share-istria",
                    "description": "I worked on look & feel development, photography, art direction, design for desktop and mobile, as well as icon design."
                }
            ]
        },
        {
            "name": "virtus dizajn",
            "position": "Web designer",
            "period": "February 2014 - April 2014",
            "id": "virtus-dizajn",
            "url": "http://bit.ly/2k4x7Vu",
            "introduction": "It was my lucky job. They gave me chance me to come back to Zagreb after bad family situation. I worked on a couple of nice urls that I designed and coded. However, the way they have run business didn't fit my view, so I went on the search for another job."
        },
        {
            "name": "Tocka Agency",
            "position": "Graphic designer",
            "period": "July 2013 - September 2013",
            "id":"tocka",
            "url": "http://bit.ly/2ku0aCA",
            "introduction": "My first real job. It was short, but I had a great experience. I was learning from them, and made friends along the way."
        }
    ],
    "education":{
        "formal": [
            {
                "name": "University of Zagreb - Faculty of Graphic Arts, Croatia",
                "period": "2010 - 2013",
                "id": "grf"
            },
            {
                "name": "Natural sciences & mathematics gymnasium in Požega, Croatia",
                "period": "2006 - 2010",
                "id": "gim"
            }
        ],
        "courses": [
            {
                "name": "Human-Centered Design",
                "info": "2014, Coursera"
            },
            {
                "name": "Design: Creation of Artifacts in Society",
                "info": "2013, Coursera"
            },
            {
                "name": "Introductory Human Physiology",
                "info": "2013, Coursera"
            },
            {
                "name": "Gamification",
                "info": "2013, Coursera"
            },
            {
                "name": "A Beginner’s Guide to Irrational Behavior",
                "info": "2013, Coursera"
            },
            {
                "name": "Human computer interaction",
                "info": "2012, Coursera"
            }
        ]
    },
    "personal-projects": [
        {
            "name": "Designer's road",
            "url": "http://bit.ly/designersroad",
            "id": "designers-road",
            "description": "Travel blog I have started to share my experiences and photos in the hope that it will help others to get courage and go on the road."
        }
    ],
    "skills": [
        "Web & Mobile app design with a focus on user experience and interactions using Sketch and Photoshop.",
        "Front-end development with strong orientation on semantic HTML and CSS architecture.",
        "JavaScript - junior, but learning and growing every day.",
        "Prototyping with InVision, Balsamiq mockups and Framer JS.",
        "Comfortable using terminal,  git and phabricator.",
        "Illustration and drawing artisan.",
        "Photography geek.",
        "Decent experience with animation in After Effects. <a href='http://bit.ly/sg-animations'>Check out</a>.",
        "Some experience with 3D modeling."
    ]
}
