{
    "introduction": "My name is Stjepan Grgic. I describe myself as a designer who loves to code, take photos, draw... Interaction design and user experience are the fields I focus most of my energy lately. There, I can be creative with everything I love to do.<br> Drawing helps me visualize my thoughts and express my ideas. Photography was essential for my understanding of light, color and all principles of great design.<br> Coding gives me the power to prototype interactions and to build anything I can imagine.<br> Currently, I am living in Zagreb, Croatia where I run my own UI/UX design studio called <a href='http://bit.ly/underlayer-design' target='_blank'>underlayer</a>.",
    "employment": [
        {
            "name": "Underlayer",
            "position": "Founder, designer and develper",
            "period": "January 2016 - present",
            "website": "http://underlayer.design/",
            "introduction": "I have started underlayer studio with hopes I will be able to run business all by myself. I worked on few nice projects. But, it was a tough year. I learned a lot. I saw how business requires a lot of effort so now I can appreciate business people much more.",
            "projects": [
                {
                    "name": "Memgraph",
                    "url": "http://www.memgraph.io/",
                    "description": "MemGraph is a young startup that is building next generation graph database system. I designed their logo and overall design language fo app. Also, I was working on designing and coding a web interface that will be used for querying database, monitoring machines, and monitoring performances."
                },
                {
                    "name": "Agrivi",
                    // "url": "/portfolio/Agrivi/",
                    "description": "Agrivi is agri-tech startup from Croatia. I worked on redesigning their brand identity:  a new logo, font, color palette, visual language, and imagery. My primary job was to redesign web application interface, so I worked with product guys to deliver the best experience for their users. Lastly, I worked on landing page redesign as well."
                },
                {
                    "name": "nickel&swan",
                    "url": "http://www.nickelandswan.com/",
                    "description": "Nickel&swan is a fin-tech startup focused on building innovative software traders and brokers. I worked on designing part of their web application that you can check out live <a href='http://app.nickelandswan.com/62'>here</a>."
                }
            ]
        },
        {
            "name": "Vibby",
            "position": "Designer and developer",
            "period": "March 2015 - January 2016",
            "website": "https://www.vibby.com/",
            "introduction": "I was a lead product designer. I was involved in branding, introducing new product concepts, designing experience and interface, as well as coding HTML and CSS architecture for this large scale web application. Year almost passed, and I saw I gave all that I could to the idea, so I decided i should try to go on my own.",
            "projects": [
                {
                    "name": "Vibby player",
                    "url": "https://www.vibby.com/watch?vib=71KCMcqWZUc",
                    "description": "Video player that introduced 'partial' video bits. It allowed users to watch and comment only on important/highlighted parts of the video."
                },
                {
                    "name": "Vib creation proces",
                    "url": "https://www.vibby.com/create/1",
                    "description": "A simple tree step process user had to go trough in order to create a “vib” - a shorter form of a video created from its parts."
                }
            ]
        },
        {
            "name": "Gray Entourage",
            "position": "Screen Designer",
            "period": "July 2014 - March 2015",
            "website": "http://entg.co/",
            "introduction": "In joint venture Gray Entourage, I was involved in advertising projects ranging from designing online advertising materials for clients like Microsoft, Erste Bank, Vipnet and Tomato, to designing websites for TZ Istra and Allianz. After almost a year, and beautiful time I have spent with the team, I got chance to work fro startup that I couldn't reject.",
            "projects": [
                {
                    "name": "Vip Xmas Card",
                    "url": "https://www.behance.net/gallery/23219673/Vip-Xmas-Card",
                    "description": "I was involved in whole process: from the beginning of ideation and character development to UI design and character illustration."
                },
                {
                    "name": "Share Istria",
                    "url": "https://dribbble.com/shots/2579211-Share-Istria-Landing-Page",
                    "description": "I worked on look & feel development, photography, art direction, design for desktop and mobile, as well as icon design."
                }
            ]
        },
        {
            "name": "virtus dizajn",
            "position": "Web designer",
            "period": "February 2014 - April 2014",
            "website": "http://virtus-dizajn.com/",
            "introduction": "It was my lucky job. They gave me chance me to come back to Zagreb after bad family situation. I worked on a couple of nice websites that I designed and coded. However, the way they have run business didn't fit my wiev, so I  went on the search for another job."
        },
        {
            "name": "Agencija Točka",
            "position": "Graphic designer",
            "period": "July 2013 - September 2013",
            "website": "http://tocka.co/",
            "introduction": "My first real job. It was short, but I had great experience. I was learning from them, and made friends along the way."
        }
    ],
    "education":{
        "formal": [
            {
                "name": "University of Zagreb - Faculty of Graphic Arts, Croatia",
                "period": "2010 - 2013"
            },
            {
                "name": "Natural sciences & mathematics gymnasium in Požega, Croatia",
                "period": "2006 - 2010"
            }
        ],
        "courses": [
            {
                "name": "Coursera - Human computer interaction",
                "year": "2012"
            },
            {
                "name": "Coursera - Design: Creation of Artifacts in Society",
                "year": "2013"
            },
            {
                "name": "Coursera - Introductory Human Physiology",
                "year": "2013"
            },
            {
                "name": "Coursera - Gamification",
                "year": "2013"
            },
            {
                "name": "Coursera - A Beginner’s Guide to Irrational Behavior",
                "year": "2013"
            }
        ]
    },
    "personal-projects": [
        {
            "name": "Designer's road",
            "link": "http://designersroad.com",
            "description": "Travel blog I have started to share my experiences and photos in the hope that it will help others to get courage and go on the road."
        }
    ],
    "skills": [
        "Design with a focus on user interfaces and interactions.",
        "Front-end development with strong orientation on semantic HTML and CSS (Stylus, SCSS) architecture.",
        "JavaScript - junior, but learning and growing every day.",
        "Comfortable using terminal,  git and phabricator.",
        "Illustration and drawing artisan.",
        "Photography geek.",
        "Decent experience with animation in After Effects. <a href='http://bit.ly/sg-animations'>Check out</a>.",
        "Some experience with 3D modeling and animation."
    ]
}
